% Двигатель MX2210KV360HA

L_1ph = 0.0001; %Гн
R_1ph = 0.75; %Ом
W = 450; %рад/c без нагрузки
U_dvig = 12; %В
I_noload = 0.15; %А
J_rot = 0.00075;
P_amt = 7;
nu = 0.84; %КПД
K_m = 0.025; %Н*м/А

L_3ph = L_1ph + 1/(1/L_1ph + 1/L_1ph);
R_3ph = R_1ph + 1/(1/R_1ph + 1/R_1ph);
K_w = (U_dvig - I_noload*R_1ph*2)/W;

T_q = L_3ph/R_3ph;
T_m = 0.000098;

% Планетарный редуктор
i_pgb = 3.3;

% Низкоуровневый контроллер

Kk = 22500;
Kc = 0.0015;
Ki = 0.0003;
bk0 = 0;
bk1 = 0.5;
ak0 = 1;
ak1 = 0.5;
bp0 = 1;
bp1 = 0.001;
ap0 = 1;
ap1 = 0.001;

% Высокоуровневый контроллер с ПИД-регулятором

kpp = 1; % 0.51624
kip = 0; % 5.1624e-08
kdp = 0;
kpid = 1;
