% Двигатель MX2210KV360HA

L_1ph = 0.0001; %Гн
R_1ph = 0.75; %Ом
W = 450; %рад/c без нагрузки
U_dvig = 12; %В
I_noload = 0.15; %А
J_rot = 0.00000075;
P_amt = 7;
nu = 0.84; %КПД
K_m = 0.023; %Н*м/А

L_3ph = L_1ph + 1/(1/L_1ph + 1/L_1ph);
R_3ph = R_1ph + 1/(1/R_1ph + 1/R_1ph);
Jk = 0.0000748534;
K_w = 0.023;
K_omega = 0.023;

T_q = L_3ph/R_3ph;
T_m = 0.000098;

i = 3.3;
% Низкоуровневый контроллер

Kk = 22500;
Kc = 0.0015;
Ki = 0.0003;
bk0 = 0;
bk1 = 0.5;
ak0 = 1;
ak1 = 0.5;
bp0 = 1;
bp1 = 0.001;
ap0 = 1;
ap1 = 0.001;

% Высокоуровневый контроллер с ПИД-регулятором

kpp = 0.51624; 
kip = 5.1624e-08; 
kdp = 0;
kpid = 1;

W_korr = tf([0.047978 11.4104 525.1], [0.00001616 0.1001616 1])
W_korr_discrete = c2d(W_korr,0.01,'tustin')


